## Evidence for the above

### ARM deployment template

```json
{
    "$schema": "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "name": {
            "type": "String"
        },
        "location": {
            "type": "String"
        },
        "gatewayType": {
            "defaultValue": "Vpn",
            "allowedValues": [
                "Vpn",
                "ExpressRoute"
            ],
            "type": "String"
        },
        "sku": {
            "type": "String"
        },
        "subnetId": {
            "type": "String"
        },
        "publicIpAddressId": {
            "type": "String"
        }
    },
    "resources": [
        {
            "type": "Microsoft.Network/virtualNetworkGateways",
            "apiVersion": "2020-11-01",
            "name": "[parameters('name')]",
            "location": "[parameters('location')]",
            "dependsOn": [],
            "tags": {
                "deployedBy": "terraform/azure/caf-enterprise-scale/test_framework"
            },
            "properties": {
                "gatewayType": "[parameters('gatewayType')]",
                "ipConfigurations": [
                    {
                        "name": "default",
                        "properties": {
                            "privateIPAllocationMethod": "Dynamic",
                            "subnet": {
                                "id": "[parameters('subnetId')]"
                            },
                            "publicIpAddress": {
                                "id": "[parameters('publicIpAddressId')]"
                            }
                        }
                    }
                ],
                "sku": {
                    "name": "[parameters('sku')]",
                    "tier": "[parameters('sku')]"
                }
            }
        }
    ]
}
```

### ARM resource template

```json
{
    "name": "12345-ergw-westeurope",
    "id": "/subscriptions/fa2fa118-a60d-4700-9ef1-fa02beeaaea5/resourceGroups/12345-connectivity-westeurope/providers/Microsoft.Network/virtualNetworkGateways/12345-ergw-westeurope",
    "etag": "W/\"f1b0eb9e-08fa-4673-92ed-da5ae6e5211f\"",
    "type": "Microsoft.Network/virtualNetworkGateways",
    "location": "westeurope",
    "tags": {
        "deployedBy": "terraform/azure/caf-enterprise-scale/test_framework"
    },
    "properties": {
        "provisioningState": "Succeeded",
        "resourceGuid": "b96bdd2b-baf6-48f0-bf85-93626284c0ca",
        "packetCaptureDiagnosticState": "None",
        "enablePrivateIpAddress": false,
        "isMigrateToCSES": false,
        "ipConfigurations": [
            {
                "name": "default",
                "id": "/subscriptions/fa2fa118-a60d-4700-9ef1-fa02beeaaea5/resourceGroups/12345-connectivity-westeurope/providers/Microsoft.Network/virtualNetworkGateways/12345-ergw-westeurope/ipConfigurations/default",
                "etag": "W/\"f1b0eb9e-08fa-4673-92ed-da5ae6e5211f\"",
                "type": "Microsoft.Network/virtualNetworkGateways/ipConfigurations",
                "properties": {
                    "provisioningState": "Succeeded",
                    "privateIPAllocationMethod": "Dynamic",
                    "publicIPAddress": {
                        "id": "/subscriptions/fa2fa118-a60d-4700-9ef1-fa02beeaaea5/resourceGroups/12345-connectivity-westeurope/providers/Microsoft.Network/publicIPAddresses/12345-ergw-westeurope-pip"
                    },
                    "subnet": {
                        "id": "/subscriptions/fa2fa118-a60d-4700-9ef1-fa02beeaaea5/resourceGroups/12345-connectivity-westeurope/providers/Microsoft.Network/virtualNetworks/12345-hub-westeurope/subnets/GatewaySubnet"
                    }
                }
            }
        ],
        "natRules": [],
        "virtualNetworkGatewayPolicyGroups": [],
        "enableBgpRouteTranslationForNat": false,
        "disableIPSecReplayProtection": false,
        "sku": {
            "name": "ErGw1AZ",
            "tier": "ErGw1AZ",
            "capacity": 2
        },
        "gatewayType": "ExpressRoute",
        "vpnType": "PolicyBased",
        "enableBgp": false,
        "activeActive": false,
        "vpnGatewayGeneration": "None",
        "allowRemoteVnetTraffic": false,
        "allowVirtualWanTraffic": false
    }
}
```

### Terraform plan (post import)

```shell
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.test_connectivity.azurerm_virtual_network_gateway.connectivity["/subscriptions/fa2fa118-a60d-4700-9ef1-fa02beeaaea5/resourceGroups/12345-connectivity-westeurope/providers/Microsoft.Network/virtualNetworkGateways/12345-ergw-westeurope"] must be replaced
-/+ resource "azurerm_virtual_network_gateway" "connectivity" {
      ~ active_active              = false -> (known after apply)
      ~ enable_bgp                 = false -> (known after apply)
      ~ generation                 = "None" -> (known after apply)
      ~ id                         = "/subscriptions/fa2fa118-a60d-4700-9ef1-fa02beeaaea5/resourceGroups/12345-connectivity-westeurope/providers/Microsoft.Network/virtualNetworkGateways/12345-ergw-westeurope" -> (known after apply)     
        name                       = "12345-ergw-westeurope"
      - private_ip_address_enabled = false -> null
        tags                       = {
            "deployedBy" = "terraform/azure/caf-enterprise-scale/test_framework"
        }
      ~ vpn_type                   = "PolicyBased" -> "RouteBased" # forces replacement
        # (4 unchanged attributes hidden)

      + bgp_settings {
          + asn         = (known after apply)
          + peer_weight = (known after apply)

          + peering_addresses {
              + apipa_addresses       = (known after apply)
              + default_addresses     = (known after apply)
              + ip_configuration_name = (known after apply)
              + tunnel_ip_addresses   = (known after apply)
            }
        }

      ~ ip_configuration {
          ~ name                          = "default" -> "12345-ergw-westeurope-pip"
            # (3 unchanged attributes hidden)
        }

      - timeouts {}
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```